const goOptions = [
	{
		title: '332路',
		active: 7, // 广外
		route: [
			'长江路总站', '金州新邨', '长江路口', '深井市场', '南田坊', '赤坎桥', '东四路北', '广外', '北三路南', '中二横路东', '中二横路西',
			'综合商业北区'
		]
	},
	{
		title: '大学城1线',
		active: 10,
		route: [
			'大学城总站', '广大生活区', '广大公寓', '广美生活区', '中环西路', '广大', '综合商业南区', '华工', '华工生活区', '广中医广药',
			'广外', '中环东路', '中大', '综合商业北区', '仓头立交', '琶洲大桥北', '科韵路', '棠安路', '科学院地化所', '省农干科干院',
			'广园天寿路口东', '白云索道', '景泰坑', '广园客运站', '柯子岭', '盈翠华庭', '广州体育馆', '白云国际会议中心', '外语学院',
			'外语学院总站',
		]
	},
	{
		title: '大学城3线',
		active: 11,
		route: [
			'大学城总站', '广大', '广大生活区', '广大公寓', '广美生活区', '中环西路', '广工', '综合商业南区', '华工', '华工生活区', '广中医广药',
			'广外', '中环东路', '中大', '综合商业北区', '仓头立交', '琶洲大桥南', '琶洲', '国际会展中心', '园艺', '磨碟沙', '赤岗', '赤岗东',
			'珠影', '客村', '康乐村', '中山大学', '省荣军医院', '怡乐村', '广医二院', '海珠购物中心', '江南西路', '江南新村', '海珠区妇幼', '广东药学院'
		]
	}
];
const backOptions = [
	{
		title: '332路',
		active: 4, // 广外
		route: [
			'综合商业北区', '中二横路西', '中二横路东', '北三路南', '广外', '东四路北', '赤坎桥', '南田坊', '深井市场', '长江路口', '金州新邨', '长江路总站',
		]
	},
	{
		title: '大学城1线',
		active: 20,
		route: [
			'外语学院总站', '外语学院', '白云国际会议中心', '广州体育馆', '盈翠华庭', '柯子岭', '雕塑公园', '童心北', '广园客运站', '广园中路',
			'白云索道', '金贵村', '广园天寿路口东', '省农干科干院', '科学院地化所', '棠安路', '琶洲大桥北', '北山', '中大', '中环东路', '广外',
			'广中医广药', '华工生活区', '华工', '综合商业南区', '广工', '中环西路', '广美生活区', '广大公寓', '广大生活区', '大学城总站'
		]
	},
	{
		title: '大学城3线',
		active: 20,
		route: [
			'广东药学院', '南村', '华海大厦', '广医二院', '怡乐村', '省荣军医院', '中山大学', '康乐村', '客村', '珠影', '赤岗东', '赤岗', '磨碟沙',
			'园艺', '国际会展中心', '琶洲', '琶洲大桥南', '北山', '中大', '中环东路', '广外', '广中医广药', '华工生活区', '华工', '综合商业南区',
			'广工', '中环西路', '广外', '中环西路', '广美生活区', '广大公寓', '广大生活区', '广大', '大学城总站'
		]
	}
];
const onewayOptions = [
	{
		title: '381路',
		active: 11,
		route: [
			'大学城总站', '广大', '广大生活区', '广大公寓', '广美生活区', '中环西路', '广工', '综合商业南区', '华工', '华工生活区', '广中医广药',
			'广外', '中环东路', '中大', '综合商业北区', '星海学院', '华师', '大学城总站'
		]
	},
	{
		title: '382路',
		active: 8,
		route: [
			'外环西路总站', '西五路', '大学城总站', '华师', '星海学院', '综合商业北区', '中大', '中环东路', '广外', '广中医广药', '华工生活区', '华工',
			'综合商业南区', '中心大街南', '广工', '中环西路', '广美生活区', '广大公寓', '广大生活区', '中部枢纽', '西五路', '外环西路总站'
		]
	}
];

const subwayList = [
	{
		'title': '大学城北（地铁站）',
		'distance': '1.3',
		'station': ['4号线', '12号线']
	},
	{
		'title': '大学城南（地铁站）',
		'distance': '2.0',
		'station': ['4号线', '7号线']
	}
];

export {
	goOptions,
	backOptions,
	onewayOptions,
	subwayList
}